BiboyLin/MVP-W/firmware/s3/sdkconfig.defaults
# ESP32-S3 configuration
CONFIG_IDF_TARGET="esp32s3"

# Disable component manager (use local components only)
CONFIG_IDF_COMPONENT_MANAGER=n

# PSRAM (required for audio buffers and LVGL)
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_40M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL_BITS=0

# WiFi
CONFIG_ESP_WIFI_ENABLED=y

# WebSocket
CONFIG_ESP_WEBSOCKET_CLIENT_ENABLED=y

# I2S (audio)
CONFIG_ESP_I2S_ENABLED=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Watchdog
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# LVGL
CONFIG_LV_USE_FREETYPE=n
CONFIG_LV_COLOR_16_SWAP=y

# SPI
CONFIG_SPI_MASTER=y
